# Pandas

In [1]:
import pandas as pd # import Pandas to DS

In [2]:
data_frame = pd.DataFrame(data = { # DataFrame to do table for values
    'apple':[1,2,3],
    'oranges':[4,5,6]
})
print(type(data_frame))
data_frame # return [DataFrame]

<class 'pandas.core.frame.DataFrame'>

   apple  oranges
0      1        4
1      2        5
2      3        6

### Series with Intger

In [3]:
series1 = pd.Series([1,2,3]) # index values (Series)
# print(type(series1))
print(series1) # return [Int 64]
# print(series1[1]) # return [index value]

0    1
1    2
2    3
dtype: int64

### Series with Float

In [4]:
series2 = pd.Series([1.1,2.2,3.3]) # index values (Series)
print(type(series2))
print(series2) # return [Float 64]
print(series2[1]) # return [index value]

<class 'pandas.core.series.Series'>
0    1.1
1    2.2
2    3.3
dtype: float64
2.2

### Series with string [object]

In [5]:
series3 = pd.Series(["a","b","c","d"]) # index values (Series)
print(type(series3))
print(series3) # return [object] and Int64
print(series3[1]) # return [index value]

<class 'pandas.core.series.Series'>
0    a
1    b
2    c
3    d
dtype: object
b

### Series with bool

In [6]:
series4 = pd.Series([5>2,False,True],index=[1,2,3]) # index values (Series)
print(type(series4))
print(series4) # return [bool]
print(series4[1]) # return [index value]

<class 'pandas.core.series.Series'>
1     True
2    False
3     True
dtype: bool
True

# DataFrame Pandas

In [7]:
data_frame = pd.DataFrame(data = { # DataFrame to do table for values
    'Int':series1,
    'Float':series2,
    'String':series3,
    'Bool':series4
})
print(type(data_frame))
data_frame # return [DataFrame]

<class 'pandas.core.frame.DataFrame'>

   Int  Float String   Bool
0  1.0    1.1      a    NaN
1  2.0    2.2      b   True
2  3.0    3.3      c  False
3  NaN    NaN      d   True

## DataFrame Courses

In [8]:
data_frame_courses = pd.DataFrame(data = {
    'math':[85,80,90,0],
    'python':[90,77,88,0],
    'sport':[93,85,78,0],
    'kimistry':[86,91,87,0]
}, index=['Rami','Shahd','Abood','waleed']) # Add names as index value
data_frame_courses
# describe().transpose() For more readable and statistic sammary

        math  python  sport  kimistry
Rami      85      90     93        86
Shahd     80      77     85        91
Abood     90      88     78        87
waleed     0       0      0         0

In [9]:
# Two ways to read coulmns from DataFrame
data_frame_courses.math
data_frame_courses['math']

Rami      85
Shahd     80
Abood     90
waleed     0
Name: math, dtype: int64

In [10]:
# Two ways to read rows from DataFrame
data_frame_courses.loc['Shahd'] # All rows
data_frame_courses.loc['Shahd'].math # one row
data_frame_courses.math.loc['Shahd'] # one row
data_frame_courses.loc['Shahd'].values.sum() / len(data_frame_courses.loc["Shahd"].values) # Print Avg

83.25

## Read Files

### File Number 1

In [63]:
data_frame = pd.read_csv('../datasets/IRIS.csv')
data_frame_houses = pd.read_csv('../datasets/houses_prices.csv') # Read Excel Files 
# Read Excel Files 
data_frame.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [12]:
# data_frame.iloc[5:10, 4]
# data_frame.iloc[[0, 1, 2], 4]
# data_frame.iloc[:-145, 4]
# data_frame.loc[:-145, 4]
# data_frame.set_index('sepal_width') # set features as index
# pd.DataFrame(data_frame.petal_length == 1.4) # return dataFrame with true and false

# return all rows with petal_length = 1.4 and sepal_width = 3.0
# data_frame.loc[(data_frame.petal_length == 1.4) | (data_frame.sepal_width == 3.0)] 

# will return rows who has the same one value in list. 
# data_frame.loc[data_frame.species.isin(['Iris-setosa','Iris-versicolor'])]

# will return all rows who is not null.
# data_frame.loc[data_frame.species.notnull()] 

# add new column to dataframe
# for in range(len())

# LOOP TO CHANGE DATA ON DATA_FRANE   
# for index in data_frame.index:
#     if data_frame.loc[index,'species'] == 'Iris-setosa':
#         data_frame.loc[index,'color'] = "red"
#     elif data_frame.loc[index,'species'] == 'Iris-versicolor':
#         data_frame.loc[index,'color'] = "white"
#     else:
#         data_frame.loc[index,'color'] = "blue"

### Shape

In [13]:
data_frame.shape # return (rows, columns)

(150, 5)

### File Number 2 movie data by IMDB

In [14]:
data_frame = pd.read_csv('../datasets/IRIS.csv') # Read Excel Files

# return value counts 
data_frame.species.value_counts()
df = data_frame.sepal_width.map(lambda p: p - 1)
df
data_frame.sepal_width

# sums = 0
# for i in data_frame.Rank:
#     sums += i
# "mean = "+ str(sums / len(data_frame.Rank))

0      3.5
1      3.0
2      3.2
3      3.1
4      3.6
      ...
145    3.0
146    2.5
147    3.0
148    3.4
149    3.0
Name: sepal_width, Length: 150, dtype: float64

In [15]:
data_frame.columns # print index count

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [16]:
print(data_frame.head()) # head def [Return : first five elements]
print('\n----------------DATA SCIENCE-----------------\n')
print(data_frame.head(3)) # head def [Return : first three elements]

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

----------------DATA SCIENCE-----------------

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa

In [17]:
print(data_frame.tail()) # tail def [Return : last five elements]
print('\n----------------DATA SCIENCE-----------------\n')
print(data_frame.tail(3)) # tail def [Return : last three elements]

     sepal_length  sepal_width  petal_length  petal_width         species
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

----------------DATA SCIENCE-----------------

     sepal_length  sepal_width  petal_length  petal_width         species
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

## Times

In [18]:
import datetime
now = datetime.datetime.now()
print(now)
print(now.year)
print(now.month)
print(now.day)
print(now.strftime('%A'))
print(now.strftime('%b'))

2021-07-26 15:37:17.699530
2021
7
26
Monday
Jul

In [19]:
data_frame.dropna()

     sepal_length  sepal_width  petal_length  petal_width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [20]:
data_frame.info() # To get info of dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

## Map and Aplly functions

In [21]:
# it will check all rows in dataFrame and return series. 
data_frame.species.map(lambda name: "Iris-virginica" in name).sum()

50

In [22]:
# apply function to do loop with function.
def virginica(row):
    if row.species == 'Iris-virginica':
        return True
star_ratings = data_frame.apply(virginica, axis='columns')
star_ratings

0      None
1      None
2      None
3      None
4      None
       ...
145    True
146    True
147    True
148    True
149    True
Length: 150, dtype: object

In [23]:
data_frame.head(5)

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

## Group by function

In [24]:
# it return series with groupby values from dataFrame.
data_frame.groupby('sepal_length').species.count()
# data_frame.groupby('sepal_length').species.describe()

# data_frame.groupby('sepal_length').apply(lambda p: data_frame.species.iloc[1])

sepal_length
4.3     1
4.4     3
4.5     1
4.6     4
4.7     2
4.8     5
4.9     6
5.0    10
5.1     9
5.2     4
5.3     1
5.4     6
5.5     7
5.6     6
5.7     8
5.8     7
5.9     3
6.0     6
6.1     6
6.2     4
6.3     9
6.4     7
6.5     5
6.6     2
6.7     8
6.8     3
6.9     4
7.0     1
7.1     1
7.2     3
7.3     1
7.4     1
7.6     1
7.7     4
7.9     1
Name: species, dtype: int64

## Sorting and Grouping

In [47]:
# agg() method use to arrangement outbut.
# reset_index() method use to add new index to the dataframe.
# data_frame.groupby(['sepal_length']).species.agg([len]).reset_index()

# sort_index() umethod use to sort dataframe with index.
# data_frame.groupby(['sepal_length']).species.agg([len]).reset_index().sort_values(by='sepal_length')

# sort_values() method use for sorting data with 1 column.
# data_frame.groupby(['sepal_length']).species.agg([len,min,max]).reset_index().sort_values(by='len',ascending=True)

    sepal_length  len
0            4.3    1
1            4.4    3
2            4.5    1
3            4.6    4
4            4.7    2
5            4.8    5
6            4.9    6
7            5.0   10
8            5.1    9
9            5.2    4
10           5.3    1
11           5.4    6
12           5.5    7
13           5.6    6
14           5.7    8
15           5.8    7
16           5.9    3
17           6.0    6
18           6.1    6
19           6.2    4
20           6.3    9
21           6.4    7
22           6.5    5
23           6.6    2
24           6.7    8
25           6.8    3
26           6.9    4
27           7.0    1
28           7.1    1
29           7.2    3
30           7.3    1
31           7.4    1
32           7.6    1
33           7.7    4
34           7.9    1

## Data Type

In [39]:
data_frame.sepal_length.dtype # return float
data_frame.index.dtype # return Intger
data_frame.index.astype('float64') # return values as float
data_frame.dtypes # return object with data types of columns

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

## Missing Values

In [42]:
data_frame[pd.isnull(data_frame.sepal_length)] # return all rows with null values.
data_frame.sepal_length.fillna("empty") # convert NaN to empty value

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_length, Length: 150, dtype: float64

In [45]:
data_frame.sepal_length.replace(5.1,5.2)

0      5.2
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_length, Length: 150, dtype: float64

## Renaming and Combining

In [62]:
# Renaming.
df = data_frame.rename(columns={'species': 'speciess'}) # rename column
df = data_frame.rename(index={0: 'first', 1: 'second'}) # rename index
df = data_frame.rename_axis("index", axis='rows').rename_axis("fields", axis='columns')
df

fields  sepal_length  sepal_width  petal_length  petal_width         species
index
0                5.1          3.5           1.4          0.2     Iris-setosa
1                4.9          3.0           1.4          0.2     Iris-setosa
2                4.7          3.2           1.3          0.2     Iris-setosa
3                4.6          3.1           1.5          0.2     Iris-setosa
4                5.0          3.6           1.4          0.2     Iris-setosa
...              ...          ...           ...          ...             ...
145              6.7          3.0           5.2          2.3  Iris-virginica
146              6.3          2.5           5.0          1.9  Iris-virginica
147              6.5          3.0           5.2          2.0  Iris-virginica
148              6.2          3.4           5.4          2.3  Iris-virginica
149              5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [65]:
# Combining
pd.concat([data_frame_houses,data_frame]).head()

,Id,MSSubClass,MSZoning,LotFrontage,LotArea,Street,Alley,LotShape,LandContour,Utilities,...,MoSold,YrSold,SaleType,SaleCondition,SalePrice,sepal_length,sepal_width,petal_length,petal_width,species
0,1.0,60.0,RL,65.0,8450.0,Pave,NaN,Reg,Lvl,AllPub,...,2.0,2008.0,WD,Normal,208500.0,NaN,NaN,NaN,NaN,NaN
1,2.0,20.0,RL,80.0,9600.0,Pave,NaN,Reg,Lvl,AllPub,...,5.0,2007.0,WD,Normal,181500.0,NaN,NaN,NaN,NaN,NaN
2,3.0,60.0,RL,68.0,11250.0,Pave,NaN,IR1,Lvl,AllPub,...,9.0,2008.0,WD,Normal,223500.0,NaN,NaN,NaN,NaN,NaN
3,4.0,70.0,RL,60.0,9550.0,Pave,NaN,IR1,Lvl,AllPub,...,2.0,2006.0,WD,Abnorml,140000.0,NaN,NaN,NaN,NaN,NaN
4,5.0,60.0,RL,84.0,14260.0,Pave,NaN,IR1,Lvl,AllPub,...,12.0,2008.0,WD,Normal,250000.0,NaN,NaN,NaN,NaN,NaN